brew "eza"
brew "git"
brew "zsh"
brew "htop"
brew "micromamba"
brew "rustup"
brew "spaceship"
brew "uv"
brew "vim"
brew "watch"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

cask "1password"
cask "1password-cli"
cask "brainfm"
cask "cursor"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "readdle-spark"
cask "slack"
cask "spotify"
cask "superkey"
cask "todoist"
cask "visual-studio-code"
cask "zoom"

cask "nikitabobko/tap/aerospace"

# DataFusion
brew "protobuf"

